#Напишите скрипт, позволяющий определить надежность вводимого
#пользователем пароля. Это задание является творческим: алгоритм
#определения надежности разработайте самостоятельно.
#1)Если пароль меньше 7 символов,то выдать сообщение недопустимый пароль
#2)Если пароль равен 12 символам,то выдать сообщение слабый пароль
#3)Если пароль состоит только из цифр,то выдать сообщение слабый пароль
#4)Если пароль состоит от 7 до 12 символов,которые состоят из верхнего и нижнего регистра,то выдать сообщение надежный пароль

password = input("Введите пароль: ")
password1 = ""
if len(password) < 7:
     d = "Недопустимый пароль"
     print(d)
elif password.isdigit():
    d = "Ненадежный пароль"
    print(d)
if len(password) == 12:
   d = "слабый пароль"
   print(d)
while True:
     for i in (password):
         if i.isupper() + i.islower():
            d = "Надежный пароль"
            print(d)
            exit(0)