#Напишите скрипт, который позволяет ввести с клавиатуры текст
#предложения и сформировать новую строку на основе исходной, в
#которой все слова, начинающиеся с большой буквы, приведены к
#верхнему регистру. Слова могут разделяться запятыми или пробелами.
#Например, если пользователь введет строку «город Донецк, река
#Кальмиус», результирующая строка должна выглядеть так: «город
#ДОНЕЦК, река КАЛЬМИУС»
#isalnum() определяет, состоит ли строка из букв и цифр.



s = input("Введите текст: ")
lst = "".join([" " if not i.isalnum() else i for i in s]).split()
result = " ".join([i.upper() if i.istitle() else i for i in lst])
print(result)


